In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [3]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [4]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns =["Column1","Column2","Column3"] )

In [5]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [7]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [8]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [9]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [14]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [15]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [17]:
df.fillna(value = 100)

        Column1  Column2  Column3
Index1     10.0     20.0    100.0
Index2      5.0    100.0    100.0
Index3     21.0    100.0     10.0

In [18]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [20]:
df.sum().sum()

66.0

In [21]:
df.size

9

In [23]:
df.isnull().sum().sum()

4

In [24]:
def calculateMean(df):
    totalSum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return totalSum / totalNum

In [27]:
df.fillna(value = calculateMean(df),inplace = True)

In [28]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0